In [2]:
from datetime import datetime

In [3]:
my_year=2024
my_month=3
my_day=25
my_hours=16
my_minutes=3
my_second=56

In [6]:
my_date=datetime(my_year,my_month,my_day)

In [7]:
my_date

datetime.datetime(2024, 3, 25, 0, 0)

In [10]:
my_date=datetime(my_year,my_month,my_day,my_hours,my_minutes,my_second)

In [11]:
my_date

datetime.datetime(2024, 3, 25, 16, 3, 56)

In [12]:
my_date.year

2024

In [16]:
my_date.ctime()

'Mon Mar 25 16:03:56 2024'

In [17]:
import pandas as pd

In [22]:
myser = pd.Series(['Nov 3, 2000', '2000-01-01', None])

In [23]:
myser

0    Nov 3, 2000
1     2000-01-01
2           None
dtype: object

In [28]:
pd.to_datetime(myser,format='mixed')

0   2000-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

In [29]:
obvious_euro_date="31-12-2000"

In [34]:
pd.to_datetime(obvious_euro_date)

C:\Users\kavin\AppData\Local\Temp\ipykernel_12192\398156240.py:1: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  pd.to_datetime(obvious_euro_date)

Timestamp('2000-12-31 00:00:00')

In [35]:
pd.to_datetime(obvious_euro_date,dayfirst=True)

Timestamp('2000-12-31 00:00:00')

In [32]:
american_date="10-12-2020"

In [33]:
pd.to_datetime(american_date)

Timestamp('2020-10-12 00:00:00')

In [39]:
pd.to_datetime(myser,format='mixed')[0].day

3

In [44]:
styles_date="12--Oct--2000"

In [45]:
pd.to_datetime(styles_date,format="%d--%b--%Y")

Timestamp('2000-10-12 00:00:00')

In [46]:
strange_date="12th of Sep 2024"

In [47]:
pd.to_datetime(strange_date)

Timestamp('2024-09-12 00:00:00')

In [48]:
df=pd.read_csv("./data-files/RetailSales_BeerWineLiquor.csv")

In [53]:
df

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           340 non-null    object
 1   MRTSSM4453USN  340 non-null    int64
dtypes: int64(1), object(1)
memory usage: 5.4+ KB

In [56]:
df["DATE"]=pd.to_datetime(df["DATE"])

In [58]:
df["DATE"]

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [64]:
df.iloc[0:2]["DATE"][0]

Timestamp('1992-01-01 00:00:00')

In [65]:
sales=pd.read_csv("./data-files/RetailSales_BeerWineLiquor.csv",parse_dates=[0])

In [67]:
sales["DATE"]

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [68]:
sales

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [72]:
sales.set_index("DATE").resample(rule="A").mean()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000

In [79]:
sales["DATE"].dt.year

0      1992
1      1992
2      1992
3      1992
4      1992
       ...
335    2019
336    2020
337    2020
338    2020
339    2020
Name: DATE, Length: 340, dtype: int32